# IFamilyLoadOptions Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFamilyLoadOptions Interface
Members See Also
---
An interface class which provide the callback for family load options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IFamilyLoadOptions
```

Visual Basic
---
```text
Public Interface IFamilyLoadOptions
```

Visual C++
---
```text
public interface class IFamilyLoadOptions
```

# Remarks
If the family is not loaded, or if the family is loaded but unchanged, the situation will never trigger and OnFamilyFound(Boolean, Boolean%) and OnSharedFamilyFound(Family, Boolean, FamilySource%, Boolean%) will not be called. Only if the family is loaded and changed should the interface methods be called.
# See Also
IFamilyLoadOptions Members
Autodesk.Revit.DB Namespace